{  "name": "Instabot Trader",  "version": "1.0.0",  "description": "Auto trade anywhere from anything.",  "title": "Instabot Trader",  "header": {    "title": "Introduction",    "content": "<ul>\n<li><a href=\"#api-setup\">Setup Guide</a></li>\n<li><a href=\"#sections\">Supported Actions</a></li>\n</ul>\n<h1 id=\"api-intro\">Introduction</h1>\n<p>Automate placing complex trades on a selection of exchanges.</p>\n<p>Trigger your trades from...</p>\n<ul>\n<li>TradingView alerts</li>\n<li>A simple form on a web page (example included)</li>\n<li>email or SMS</li>\n<li>Anything that can send an HTTP request (IFTTT, Zapier etc)</li>\n<li>even from the command line, if that's your thing.</li>\n</ul>\n<p>Place simple limit orders or complex sequences of trades...</p>\n<ul>\n<li>Scaled orders, even on exchanges that don't offer this (like Bitmex and Deribit)</li>\n<li>Stepped market orders (a series of market orders spread over a period of time)</li>\n<li>Basic limit, market and stop orders</li>\n<li>Send yourself notifications (SMS or Slack) of progress and account balances / status.</li>\n<li>Chains of the above (for example, scaled order, wait a while, cancel unfilled orders, replace with market orders etc)</li>\n</ul>\n<h2>How?</h2>\n<p>You send some text to Instabot Trader, with a list of actions to execute. It reads the\nmessage and looks for actions you want to execute on supported exchanges.</p>\n<p>Each message looks a bit like this...</p>\n<pre><code>Any text you like here...\n\nexchangeName( instrument ) {\n    action1(value1, value2);\n    action2(value1, value2);\n}\n\nYou can have more action lists here, so you can execute commands\non several exchanges at the same time.\n</code></pre>\n<h2>Give us a simple example...</h2>\n<p>OK, lets place a limit order at Bitfinex to buy 1 BTC. We'll put the\nbid in $50 below the current price...</p>\n<pre><code>bitfinex(BTCUSD) { limitOrder(side=buy, amount=1btc, offset=50); } \n</code></pre>\n<p>or how about place a scaled order on Bitmex. Same amount, but lets\nspread it over 25 orders from $20 below the current price, down to $70\nbelow the current price...</p>\n<pre><code>Scaling in on mex...\nbitmex(XBTUSD) { \n  scaledOrder(side=buy, amount=1btc, from=20, to=70, orderCount=25); \n} \n</code></pre>\n<p>Easy.</p>\n<h2>But how do I send these messages?</h2>\n<p>If you use TradingView, set up an alert that triggers when you want to trade.\nSet the Alert Message to your list of actions. Change a couple of settings\nin TradingView and then you'll trigger some actions every time that alert fires.\n24 hours a day, 7 days a week.\n(see the setup and config sections below for details on setting this up).</p>\n<p>Instabot Trader listens for messages sent to it over the web, so anything\nthat can make HTTP requests will be able to trigger the bot to execute\ntrades for you. It's possible to set it up to respond to emails, SMS messages\nand loads more - see the setup guide for more details.</p>\n<h2>Which exchanges are supported?</h2>\n<ul>\n<li>Bitfinex - Spot Exchange</li>\n<li><a href=\"https://www.deribit.com/reg-1657.8470\">Deribit</a> - Bitcoin Futures</li>\n<li>Bitmex - Bitcoin Futures</li>\n</ul>\n<h1 id=\"api-setup\">Setup Guide</h1>\n<p>Things you'll need...</p>\n<ul>\n<li>Node.js v8.7.0 or better</li>\n<li>[optional] TradingView account, with a script that can trigger alerts when it's time to buy and sell.</li>\n<li>[optional] Twilio account, that can listen for SMS messages and make an HTTP request to the bot.</li>\n<li>[optional] Mailgun account, that can listen for Email-to-SMS emails and make HTTP requests to the bot.</li>\n<li>[optional] ngrok to tunnel those HTTP requests if you are running on a local machine that\nis not reachable from the internet.</li>\n<li>[optional] PM2 to manage the app and keep it running</li>\n</ul>\n<h2>Installation</h2>\n<p>Requires Node.js. Tested on Node V8.7.0</p>\n<p>Clone or copy the source code to a new folder, then...</p>\n<pre><code>cd instabot-trader\nnpm install\nnpm run setup\n</code></pre>\n<h3>Edit the config</h3>\n<p>The last command above should have created a config file for you.\nOpen <code>config/production.json</code> in your favourite editor.</p>\n<p>Before Instabot Trader can place any trades, you'll need to add some API keys.</p>\n<h3>Launch for the first time</h3>\n<pre><code class=\"language-bash\">node trader.js\n</code></pre>\n<ol>\n<li>Copy the file <code>.env.example</code> to <code>.env</code> and edit it (docs for settings below).\nReplace all the defaults with your settings and add all your API keys. I\nrecommend setting up with the Bitmex Testnet API keys first before you start live trading.</li>\n<li>Pick a random string for the URL endpoint (I recommend a UUID) and set this in the <code>.env</code> file.\nThe URL of the bot\nwill be <code>http://youDomain.com:&lt;PORT&gt;/&lt;UUID&gt;/bot</code> for the Twilio SMS endpoint and\n<code>http://youDomain.com:&lt;PORT&gt;/&lt;UUID&gt;/ebot</code> for the MailGun email endpoint.\nNote: You will need a URL that is accessible over the internet. If you are running on a\nlocal machine that can not be reached on the public internet, you can use a tool like\n<code>ngrok</code> to create a secure tunnel and give you a public URL.</li>\n<li>Run the node server with <code>node main.js</code> (or via PM2 with <code>pm2 start Trader</code>).</li>\n</ol>\n<h3>Setting up on a computer that isn't reachable on the public Internet.</h3>\n<p>This step is only required if you are running the bot behind a firewall or router\n(eg, you are running it from a PC in your house, not in a data center like AWS).\nIf you are using a PC at home, it won't be publicly accessible from the internet. You'll\nneed to set up a tunnel to forward alert requests to you. <code>ngrok</code> is a simple tool that does this.\nOnce you've downloaded ngrok, you can start the tunnel using this command...</p>\n<p>``ngrok http -bind-tls=true 3000```</p>\n<p>Where 3000 is the port you've configure the bot to run on. ngrok will tell you the public URL\nwhich will normally look like <code>randomletters.ngrok.io</code>. Treat this as your domain from step 2\nabove. You can pay ngrok a few dollars to get a fixed domain that stays the same each time you\nrun it. Set up your fixed domain at ngrok and then start it like this...</p>\n<p><code>ngrok http -subdomain=myNewSubDomain -bind-tls=true 3000</code></p>\n<h3>Setting up TradingView to use SMS</h3>\n<ol>\n<li>Create an account on Twilio (https://www.twilio.com/) and get yourself a phone number</li>\n<li>Configure it to forward incoming messages to the bots SMS public URL.</li>\n<li>Send a test SMS from your phone to the Twilio number and you should see the\nmessage on the terminal. Without any bot commands the SMS will be ignored.</li>\n<li>Configure TradingView to use the SMS number Twilio allocated you. It will\nsend you a code to active it, but this should appear on the console from the\nnode.js app</li>\n<li>Set up trading algo in TradingView and configure alerts. The alert message\nis used to control the bot. It can contain any text you like as long as it\nincludes the bot command somewhere.</li>\n</ol>\n<h3>Setting up TradingView to use Emails</h3>\n<ol>\n<li>Create an account at Mailgun (https://www.mailgun.com/).</li>\n<li>Get yourself a domain and set it up according to mailguns instructions.\nThis basically means setting up MX records, so mailgun can receive email on your domain.</li>\n<li>Set up a route in mailgun to forward all emails from TradingView to the bots public URL (the ebot one).</li>\n<li>In TradingViews profile settings, enter the email address that will be managed by Mailgun\nin the <code>SMS Email</code> box. Any email sent to this address will be forwarded to the bot (Mailgun\nlets you add filters to the rules, so you could only forward emails from TradingView if you like).</li>\n<li>Create alerts like normal in TradingView and tick the SMS-to-Email option.\nPlace the commands in the Alert text.</li>\n</ol>\n<h3>General TradingView tips</h3>\n<p>It's a good idea to choose the 'Once per bar close' option, so you don't get the same alert\nfiring multiple times during a candle forming.</p>\n<p>If you change the config settings for any of your indicators (or change the source code),\nyou will need to replace all your alerts with new ones. The server side alerts run the indicator\nwith the settings and source code that were current at the time the alert was created.</p>\n<h2>Running with pm2</h2>\n<p>PM2 keeps the node app running. If node crashes for any reason, the app will be instantly\nrestarted. You'll get an SMS alert to notify you about this if you've configured Twilio.</p>\n<p>The config for the stack is found in <code>stack.config.js</code>.</p>\n<h3>Some handy commands for PM2</h3>\n<p>start everything from scratch</p>\n<p><code>pm2 start stack.config.js</code></p>\n<p>Reload everything after a config change or code change</p>\n<p><code>pm2 restart stack.config.js --update-env</code></p>\n<p>Show what's up</p>\n<p><code>pm2 status</code></p>\n<p><code>pm2 list</code></p>\n<p><code>pm2 monit</code></p>\n<p>Watch the logs</p>\n<p><code>tail -f /home/vagrant/.pm2/logs/Trader-out-2.log -n 1000</code></p>\n<p>You can also use the PM2 built in log viewer (<code>pm2 logs</code>), but this can mess\nup the results a bit.</p>\n<h1 id=\"api-config\">Config</h1>\n<p>more</p>\n"  },  "sampleUrl": false,  "defaultVersion": "0.0.0",  "apidoc": "0.3.0",  "generator": {    "name": "apidoc",    "time": "2018-10-03T18:19:34.461Z",    "url": "http://apidocjs.com",    "version": "0.17.6"  }}
